[Killed] BlockStatement
src/utils.ts:4:12
 export function verificarSeGeraLucro(
   valorVenda: number,
   valorCusto: number
-): boolean {
-  return valorVenda > valorCusto;
-}
+): boolean {}
 
killedBy: Testes para verificarSeGeraLucro deve garantir que não terá lucro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
src/utils.ts:5:10
   valorVenda: number,
   valorCusto: number
 ): boolean {
-  return valorVenda > valorCusto;
+  return valorVenda >= valorCusto;
 }
 
killedBy: Testes para verificarSeGeraLucro deve garantir que não terá lucro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils.ts:5:10
   valorVenda: number,
   valorCusto: number
 ): boolean {
-  return valorVenda > valorCusto;
+  return true;
 }
 
killedBy: Testes para verificarSeGeraLucro deve garantir que não terá lucro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
